---
kind: property
id: P:Autodesk.Revit.DB.ScheduleFilter.IsDoubleValue
source: html/27d2efc3-39f8-ba90-06e3-454c7889284c.htm
---
# Autodesk.Revit.DB.ScheduleFilter.IsDoubleValue Property

Indicates if the filter has a double value.

## Syntax (C#)
```csharp
public bool IsDoubleValue { get; }
```